jsayres82/PIC32_Shapeoko_Controller/Firmware/CNC.X/src/app/app_tasks/program_planner.c
/*                             STEPPER RATE DEFINITION
                                     +--------+   <- nominal_rate
                                    /          \
    nominal_rate*entry_factor ->   +            \
                                   |             + <- nominal_rate*exit_factor
                                   +-------------+
                                       time -->
*/
// Calculates trapezoid parameters so that the entry- and exit-speed is compensated by the provided factors.
// The factors represent a factor of braking and must be in the range 0.0-1.0.
// This converts the planner parameters to the data required by the stepper controller.
// NOTE: Final rates must be computed in terms of their respective blocks.
static void calculate_trapezoid_for_block(block_t *block, float entry_factor, float exit_factor)
{
  block->initial_rate = ceil(block->nominal_rate*entry_factor); // (step/min)
  block->final_rate = ceil(block->nominal_rate*exit_factor); // (step/min)
  int32_t acceleration_per_minute = block->rate_delta*ACCELERATION_TICKS_PER_SECOND*60.0; // (step/min^2)
  int32_t accelerate_steps =
    ceil(estimate_acceleration_distance(block->initial_rate, block->nominal_rate, acceleration_per_minute));
  int32_t decelerate_steps =
    floor(estimate_acceleration_distance(block->nominal_rate, block->final_rate, -acceleration_per_minute));

  // Calculate the size of Plateau of Nominal Rate.
  int32_t plateau_steps = block->step_event_count-accelerate_steps-decelerate_steps;

  // Is the Plateau of Nominal Rate smaller than nothing? That means no cruising, and we will
  // have to use intersection_distance() to calculate when to abort acceleration and start braking
  // in order to reach the final_rate exactly at the end of this block.
  if (plateau_steps < 0) {
    accelerate_steps = ceil(
      intersection_distance(block->initial_rate, block->final_rate, acceleration_per_minute, block->step_event_count));
    accelerate_steps = max(accelerate_steps,0); // Check limits due to numerical round-off
    accelerate_steps = min(accelerate_steps,block->step_event_count);
    plateau_steps = 0;
  }

  block->accelerate_until = accelerate_steps;
  block->decelerate_after = accelerate_steps+plateau_steps;
}

/*                            PLANNER SPEED DEFINITION
                                     +--------+   <- current->nominal_speed
                                    /          \
         current->entry_speed ->   +            \
                                   |             + <- next->entry_speed
                                   +-------------+
                                       time -->
*/
// Recalculates the trapezoid speed profiles for flagged blocks in the plan according to the
// entry_speed for each junction and the entry_speed of the next junction. Must be called by
// planner_recalculate() after updating the blocks. Any recalulate flagged junction will
// compute the two adjacent trapezoids to the junction, since the junction speed corresponds
// to exit speed and entry speed of one another.
static void planner_recalculate_trapezoids()
{
  uint8_t block_index = block_buffer_tail;
  block_t *current;
  block_t *next = Null;

  while(block_index != block_buffer_head) {
    current = next;
    next = &block_buffer[block_index];
    if (current) {
      // Recalculate if current block entry or exit junction speed has changed.
      if (current->recalculate_flag || next->recalculate_flag) {
        // NOTE: Entry and exit factors always > 0 by all previous logic operations.
        calculate_trapezoid_for_block(current, current->entry_speed/current->nominal_speed,
          next->entry_speed/current->nominal_speed);
        current->recalculate_flag = false; // Reset current only to ensure next trapezoid is computed
      }
    }
    block_index = next_block_index( block_index );
  }
  // Last/newest block in buffer. Exit speed is set with MINIMUM_PLANNER_SPEED. Always recalculated.
  calculate_trapezoid_for_block(next, next->entry_speed/next->nominal_speed,
    MINIMUM_PLANNER_SPEED/next->nominal_speed);
  next->recalculate_flag = false;
}

// Recalculates the motion plan according to the following algorithm:
//
//   1. Go over every block in reverse order and calculate a junction speed reduction (i.e. block_t.entry_speed)
//      so that:
//     a. The junction speed is equal to or less than the maximum junction speed limit
//     b. No speed reduction within one block requires faster deceleration than the one, true constant
//        acceleration.
//   2. Go over every block in chronological order and dial down junction speed values if
//     a. The speed increase within one block would require faster acceleration than the one, true
//        constant acceleration.
//
// When these stages are complete all blocks have an entry speed that will allow all speed changes to
// be performed using only the one, true constant acceleration, and where no junction speed is greater
// than the max limit. Finally it will:
//
//   3. Recalculate trapezoids for all blocks using the recently updated junction speeds. Block trapezoids
//      with no updated junction speeds will not be recalculated and assumed ok as is.
//
// All planner computations are performed with doubles (float on Arduinos) to minimize numerical round-
// off errors. Only when planned values are converted to stepper rate parameters, these are integers.

static void planner_recalculate()
{
  planner_reverse_pass();
  planner_forward_pass();
  planner_recalculate_trapezoids();
}

void plan_reset_buffer()
{
  block_buffer_tail = block_buffer_head;
  next_buffer_head = next_block_index(block_buffer_head);
}

void plan_init()
{
  plan_reset_buffer();
  memset(&pl, 0, sizeof(pl)); // Clear planner struct
}

void plan_discard_current_block()
{
  if (block_buffer_head != block_buffer_tail) {
    block_buffer_tail = next_block_index( block_buffer_tail );
  }
}

block_t *plan_get_current_block()
{
  if (block_buffer_head == block_buffer_tail) { return(Null); }
  return(&block_buffer[block_buffer_tail]);
}

// Returns the availability status of the block ring buffer. True, if full.
uint8_t plan_check_full_buffer()
{
  if (block_buffer_tail == next_buffer_head) { return(true); }
  return(false);
}

// Block until all buffered steps are executed or in a cycle state. Works with feed hold
// during a synchronize call, if it should happen. Also, waits for clean cycle end.
void plan_synchronize()
{
  //while (plan_get_current_block() || sys.state == STATE_CYCLE) {
  //  protocol_execute_runtime();   // Check and execute run-time commands
  //  if (sys.abort) { return; } // Check for system abort
  //}
}

// Add a new linear movement to the buffer. x, y and z is the signed, absolute target position in
// millimeters. Feed rate specifies the speed of the motion. If feed rate is inverted, the feed
// rate is taken to mean "frequency" and would complete the operation in 1/feed_rate minutes.
// All position data passed to the planner must be in terms of machine position to keep the planner
// independent of any coordinate system changes and offsets, which are handled by the g-code parser.
// NOTE: Assumes buffer is available. Buffer checks are handled at a higher level by motion_control.
void plan_buffer_line(float x, float y, float z, float feed_rate, uint8_t invert_feed_rate)
{
  // Prepare to set up new block
  block_t *block = &block_buffer[block_buffer_head];
  uint8_t i, temp;
  uint32_t j;
  uint8_t timerCount = 0;
  // Calculate target position in absolute steps
  int32_t target[3];
  target[X_AXIS] = lround((x)*settings.steps_per_mm[X_AXIS]);//*50800);  //steps per mm
  target[Y_AXIS] = lround((y)*settings.steps_per_mm[Y_AXIS]);//*50800);  //steps per mm
  target[Z_AXIS] = lround((z)*settings.steps_per_mm[Z_AXIS]);//*65024);  //steps per mm

  // Compute direction bits for this block
//  block->direction_bits[X_AXIS] = POSITIVE;
//  block->direction_bits[Y_AXIS] = POSITIVE;
//  block->direction_bits[Z_AXIS] = POSITIVE;
//  if (target[X_AXIS] < pl.position[X_AXIS]) { block->direction_bits[X_AXIS] = NEGATIVE; }
//  if (target[Y_AXIS] < pl.position[Y_AXIS]) { block->direction_bits[Y_AXIS] = NEGATIVE; }
//  if (target[Z_AXIS] < pl.position[Z_AXIS]) { block->direction_bits[Z_AXIS] = NEGATIVE; }
  
  block->targetPos[X_AXIS] = target[X_AXIS];
  block->targetPos[Y_AXIS] = target[Y_AXIS];
  block->targetPos[Z_AXIS] = target[Z_AXIS];
  block->currentPos[X_AXIS] = pl.position[X_AXIS];
  block->currentPos[Y_AXIS] = pl.position[Y_AXIS];
  block->currentPos[Z_AXIS] = pl.position[Z_AXIS];

